In [1]:
import pandas as pd
import numpy as np

## Carregando os dados

### Dados sobre os estudates

In [2]:
df_students = pd.read_json('data/BASE B/students.json')
df_students['RegisteredDate'] = pd.to_datetime(df_students['RegisteredDate'])
df_students.head()

,Id,RegisteredDate,UniversityName,CourseName,State,SignupSource,City,StudentClient
0,12970655,2012-05-29 15:22:27.490,PUC-RIO,Administração,Rio de Janeiro,Email,NaN,NaN
1,59873654,2012-09-03 20:32:04.853,UFF,Direito do Trabalho e Segurança Social,Rio de Janeiro,Facebook,Rio de Janeiro,NaN
2,3664695,2012-09-10 20:26:30.253,UNB,Enfermagem,Distrito Federal,Facebook,NaN,NaN
3,15207697,2012-09-05 15:31:08.090,UERJ,Engenharia de Produção Mecânica,Rio de Janeiro,Facebook,Resende,NaN
4,36988693,2012-10-15 21:34:51.143,UFU,Engenharia Elétrica,NaN,Facebook,NaN,NaN

### Dados sobre os cancelamentos

In [120]:
df_cancellations = pd.read_json('data/BASE B/premium_cancellations.json')
df_cancellations['CancellationDate'] = pd.to_datetime(df_cancellations['CancellationDate'])
df_cancellations['year'] = df_cancellations['CancellationDate'].dt.year
df_cancellations['month'] = df_cancellations['CancellationDate'].dt.month
df_cancellations.head()

   StudentId        CancellationDate  year  month  day
0   34129668 2016-05-05 19:08:31.937  2016      5    1
1   34129668 2016-05-05 22:48:20.830  2016      5    1
2   82394932 2016-05-20 22:37:21.117  2016      5    1
3   82942835 2016-05-31 13:44:55.307  2016      5    1
4   85382416 2016-06-01 14:22:19.467  2016      6    1

### Dados sobre as assinaturas do plano Premium

In [105]:
%%time
df_payments = pd.read_json('data/BASE B/premium_payments.json')
df_payments['PaymentDate'] = pd.to_datetime(df_payments['PaymentDate'])

df_payments['PlanDuration'] = pd.DateOffset(months=1)
df_payments.loc[df_payments['PlanType'] == 'Anual', 'PlanDuration'] = pd.DateOffset(years=1)

df_payments['ExpiryDate'] = df_payments['PaymentDate'] + df_payments['PlanDuration']

df_payments.head()

/home/lucas/miniconda3/envs/pdenv/lib/python3.7/site-packages/pandas/core/arrays/datetimelike.py:1151: PerformanceWarning: Adding/subtracting array of DateOffsets to DatetimeArray not vectorized
  PerformanceWarning,

CPU times: user 500 ms, sys: 15.6 ms, total: 516 ms
Wall time: 522 ms

,StudentId,PaymentDate,PlanType,PlanDuration,ExpiryDate
0,12970655,2017-05-26 22:25:03.000,Anual,<DateOffset: years=1>,2018-05-26 22:25:03.000
1,12970655,2018-05-26 10:05:28.000,Anual,<DateOffset: years=1>,2019-05-26 10:05:28.000
2,12970655,2016-07-21 19:57:57.717,Mensal,<DateOffset: months=1>,2016-08-21 19:57:57.717
3,12970655,2016-08-21 08:47:42.947,Mensal,<DateOffset: months=1>,2016-09-21 08:47:42.947
4,12970655,2016-09-21 08:54:06.270,Mensal,<DateOffset: months=1>,2016-10-21 08:54:06.270

### Dados sobre as sessões

In [10]:
df_sessions = pd.read_json('data/BASE B/sessions.json')
df_sessions['SessionStartTime'] = pd.to_datetime(df_sessions['SessionStartTime'])
df_sessions.head()

   StudentId     SessionStartTime StudentClient
0   12970655  2017-02-20 14:51:37       Website
1   12970655  2017-02-22 14:04:34       Website
2   12970655  2017-02-23 13:46:14       Website
3   12970655  2017-02-23 14:52:24       Website
4   12970655  2017-03-03 20:47:21       Website

### Dados sobre as matérias que cada usuário segue

In [12]:
df_subjects = pd.read_json('data/BASE B/subjects.json')
df_subjects['FollowDate'] = pd.to_datetime(df_subjects['FollowDate'])
df_subjects.head()

,StudentId,SubjectName,FollowDate
0,12970655,Disciplina Integradora II,2015-09-12 16:00:11.000000
1,12970655,Pesquisa Operacional,2015-09-12 16:00:11.000000
2,12970655,Cálculo I,2016-06-07 17:07:35.000000
3,12970655,Introdução à Administração,2015-09-12 16:00:11.000000
4,12970655,Contabilidade Aplicada à Administração,2015-09-12 16:00:11.000000

### Dados sobre as questões feitas pelos usuários

In [19]:
df_questions = pd.read_json('data/BASE B/questions.json')
df_questions['QuestionDate'] = pd.to_datetime(df_questions['QuestionDate'])
df_questions.head()

,StudentId,QuestionDate,QuestionSnippet,StudentClient
0,12970655,2013-09-04 14:09:25.963,O que é mais importante para um projeto: escop...,NaN
1,12970655,2013-09-04 15:36:51.083,Você pode ter um negócio/produto bem sucedido ...,NaN
2,12970655,2013-10-30 19:41:43.137,Custos com consultoria para planejar um projet...,NaN
3,12970655,2013-10-30 19:19:15.517,CAPEX: investimento em consultoria entra como ...,NaN
4,12970655,2013-10-30 19:38:06.420,Custos com consultoria para planejar um projet...,NaN

### Dados sobre as respostas dadas pelos usuários

In [21]:
df_answers = pd.read_json('data/BASE B/answers.json')
df_answers['AnswerDate'] = pd.to_datetime(df_answers['AnswerDate'])
df_answers.head()

,StudentId,AnswerDate,AnswerSnippet,StudentClient
0,12970655,2013-08-30 12:27:57.190,"<p>Vou tentar <span style=""text-decoration: un...",NaN
1,12970655,2013-09-04 14:03:18.240,<p>O <strong>centil</strong> divide algo em 10...,NaN
2,12970655,2013-09-05 13:20:09.513,<p>Ou ser&aacute; que o problema que esses pro...,NaN
3,12970655,2013-09-04 19:01:56.357,<p>Excelente pergunta! Abaixo est&atilde;o as ...,NaN
4,12970655,2013-11-12 00:06:05.200,<p>Vamos supor que voc&ecirc; se compromete a ...,NaN

### Dados sobre os arquivos que cada usuário visualizou
Big, more than 3M lines

In [24]:
df_file_views = pd.read_json('data/BASE B/fileViews.json')
df_file_views.head()

,StudentId,FileName,ViewDate,Studentclient
0,12970655,Exercicios Resolvidos do Halliday sobre Rotaçã...,2017-02-23 10:46:03.047000,Website
1,12970655,Exercicios Resolvidos do Halliday sobre Rotaçã...,2017-02-23 10:46:12.370000,Website
2,12970655,CALCULO I,2017-05-25 22:39:48.000000,Website
3,12970655,CALCULO I,2017-05-25 22:40:36.000000,Website
4,12970655,CALCULO I,2017-05-25 22:43:16.000000,Website